api/schema.dot
digraph G {
    node [shape=record];

    department [label="{Department|+ department_id: int (PK)\l| name: varchar\l mission: text\l department_type: varchar\l creation_date: date\l advisor_id: int (FK)\l created_at: timestamp\l updated_at: timestamp\l}"];
    department_membership [label="{Department Membership|+ department_membership_id: int (PK)\l| user_id: int (FK) (@onDelete=SetNull)\l department_id: int (FK) (@onDelete=SetNull)\l membership_start: date\l membership_end: date\l position: enum\l created_at: timestamp\l updated_at: timestamp\l}"];
    user [label="{User|+ user_id: int (PK)\l| email: varchar\l password: varchar\l first_name: varchar\l last_name: varchar\l permission: enum\l created_at: timestamp\l updated_at: timestamp\l}"];
    profile [label="{Profile|+ profile_id: int (PK)\l| user_id: int (FK)\l phone: varchar\l birthday: date\l nationality: varchar\l description: text\l activity_status: varchar\l degree_level: varchar\l degree_name: varchar\l degree_semester: int\l degree_last_update: timestamp\l university: varchar\l full_name: varchar\l profile_picture: text\l created_at: timestamp\l updated_at: timestamp\l}"];
    contact [label="{Contact|+ contact_id: int (PK)\l| profile_id: int (FK)\l contact_type: enum\l contact_username: varchar\l created_at: timestamp\l updated_at: timestamp\l}"];

    opportunity [label="{Opportunity|+ opportunity_id: int (PK)\l| title: varchar\l description: text\l department_id: int (FK)\l opportunity_start: date\l opportunity_end: date\l created_at: timestamp\l created_by: int (FK) (@onDelete=SetNull)\l commands: json\l questions: json\l}"];
    opportunity_participation [label="{Opportunity Participation|+ user_id: int (PK, FK) (@onDelete=Cascade)\l+ opportunity_id: int (PK, FK) (@onDelete=Cascade)\l| permission: enum\l created_at: timestamp\l}"];

    review [label="{Review|+ review_id: int (PK)\l| opportunity_id: int (FK) (@onDelete=Cascade)\l assignee_id: int (FK, nullable)\l review_text: text\l created_at: timestamp\l content: json\l}"];

    user_permission_enum [label="{User Permission| admin\l member\l}"];
    opportunity_permission_enum [label="{Opportunity Permission| owner\l admin\l member\l guest\l}"];
    department_position_enum [label="{Department Position| president\l head_of_department\l board_member\l advisor\l taskforce_lead\l project_lead\l active_member\l alumni\l}"];
    contact_type_enum [label="{Contact Type| email\l slack\l github\l facebook\l instagram\l phone\l}"];

    user -> user_permission_enum [label="permission"];
    profile -> user [label="user_id"];
    contact -> profile [label="profile_id"];
    contact -> contact_type_enum [label="contact_type"];
    opportunity -> user [label="created_by"];
    opportunity -> department [label="department_id"];
    opportunity_participation -> opportunity [label="opportunity_id"];
    opportunity_participation -> user [label="user_id"];
    opportunity_participation -> opportunity_permission_enum [label="permission"];
    review -> opportunity [label="opportunity_id"];
    review -> user [label="assignee_id"];
    department -> user [label="advisor_id"];
    department_membership -> department [label="department_id"];
    department_membership -> user [label="user_id"];
    department_membership -> department_position_enum [label="position"];
}
